import { Component } from "@angular/core";
import { ModalDialogParams } from "nativescript-angular/directives/dialogs";
import { DatePicker } from "ui/date-picker";
import { securityService } from "../../../../security/security.service";
import { info } from "../../../../security/model/info.model"
@Component({
    selector: "my-modal",
    templateUrl: "showInfo.component.html",
    styleUrls: ['showInfo.component.css'],
    moduleId: module.id
})
export class showInfoComponent {
    dataUser ;
    info: info ;
    public frameworks: Array<string>;
    dataInfo = [
        {
            dataText: "   น้ำตาลในกระแสเลือด หมายถึง ระดับกลูโคสในเลือด กลูโคสในเลือดมาจากอาหารที่เรารับประทาน เช่น อาหารแป้ง ไขมัน หรือโปรตีน นอกจากนั้นน้ำตาลในเลือดส่วนหนึ่งมาจากกรสร้าง เช่นจากตับ หรือการหลั่งจากน้ำตาลที่สะสมที่ตับ ตับอ่อนจะผลิตฮอร์โมนที่ชื่อว่า อินซูลินเพื่อนำน้ำตาลเข้าเซลล์"
        },
        {
            dataText: "   Hb A1c (Hemoglobin A1c) เป็นการตรวจค่าเฉลี่ยระดับน้ำตาลในเลือดในช่วง 2-3 เดือนที่ผ่านมา เพื่อพิจารณาและประเมินผลการรักษาในภาพรวมช่วง 2-3 เดือนที่ผ่านมา ว่าคุณสามารถควบคุมระดับน้ำตาลได้หรือไม่ และใช้เพื่อการคัดกรองและวินิจฉัยภาวะเบาหวานในปัจจุบันด้วยการตรวจ Hb A1c สามารถดูผลการควบคุมระดับน้ำตาลในเลือดในช่วงที่ผ่านมาเป็นเดือนๆได้ เนื่องจาก เป็นการนำผลของระดับน้ำตาลที่เกาะอยู่ที่ส่วนประกอบในเม็ดเลือดแดง ที่เรียกว่า ฮีโมโกลบิน (hemoglobin) ซึ่งน้ำตาลนี้จะเกาะอยู่นานจนสิ้นอายุขัยของเม็ดเลือดแดง ซึ่งระยะเวลานานถึง 3 เดือน มาตรวจหาค่าเฉลี่ยนั้นเอง"
        },
        {
            dataText: "   High-density lipoprotein cholesterol (HDL-C) ประกอบไปด้วย cholesterol, phospholipid, และ protein,ซึ่งสร้างจากตับและลำไส้ HDL-c ไม่มีในอาหารร่างกายสร้างจากตับ High density lipoprotein หรือการตรวจวัดค่า HDL-c เป็นการวัดปริมาณไขมันชนิดดีต่อร่างกาย เนื่องจาก HDL-c เป็นตัวนำพาไขมันคลอเลสเตอรอลไม่ดี ออกจากเนื้อเยื่อไปทำลายที่ตับดังนั้นค่า HDL-c ยิ่งสูงยิ่งดี"
        },
        {
            dataText: "   ระดับ LDL ในเลือด มีความสัมพันธ์ชัดเจนกับการเป็นโรคหัวใจและหลอดเลือด ไขมัน LDL ทำหน้าที่เป็นตัวนำโคเลสเตอรอลทั้งหลายออกจากตับเข้าสู่กระแสเลือด เมื่อเซลล์เลือกใช้โคเลสเตอรอลที่ต้องการไปแล้ว โคเลสเตอรอลที่เหลืออยู่ในกระแสเลือดก็จะพอกเป็นตุ่มอยู่ที่ผนังของหลอด เลือดทำให้หลอดเลือดแข็ง ตีบ นานไปตุ่มเหล่านี้ปริแตกออกทำให้มีลิ่มเลือดเข้ามาผสมโรงพอกจนอุดตันหลอด เลือด ผลตามมาคืออวัยวะสำคัญที่ต้องอาศัยเลือดจากหลอดเลือดเช่นหัวใจ สมอง ไต เกิดขาดเลือดไปเลี้ยง กลายเป็นโรคเช่น หัวใจขาดเลือด อัมพาตอัมพฤกษ์ ความดันเลือดสูง ไตวาย เป็นต้น"
        },
        {
            dataText: "   ความดันโลหิต หรือ ความดันเลือด (Blood pressure) คือ ความดันในหลอดเลือดเมื่อหัว ใจบีบตัวสูบฉีดเลือดเข้าสู่หลอดเลือด ซึ่งเรียกว่า ความดันโลหิตซีสโตลิค (Systolic blood pres sure) และเมื่อหัวใจพักคลายตัว ซึ่งเรียกว่า ความดันโลหิตไดแอสโตลิค (Diastolic blood pres sure) ดังนั้น การรายงานผลความดันโลหิต จึงประกอบด้วยตัวเลข 2 ตัวเสมอ โดยจะบันทึกความดันซีสโตลิกเป็นตัวแรก หรือ ตัวบน ส่วนความดันไดแอสโตลิกจะบันทึกเป็นตัวตาม หรือ ตัวล่าง"
        },
        {
            dataText: "   ชีพจร (Pulse หรือ Pulse rate หรือ Heart rate หรือ Heart beat) คือการนับอัตราการเต้นของหัวใจ โดยนับผ่านการเต้นของหลอดเลือดแดงในระยะเวลา 1 นาที ทั้งนี้ตำแหน่งที่นิยมวัด หรือ จับชีพจร คือ ตำแหน่งด้านหน้าข้อมือส่วนที่ต่ำกว่าฐานของนิ้วหัวแม่มือ โดยการวางนิ้ว ชี้และนิ้วกลางลงบนตำแหน่งนั้น กดลงเบาๆก็จะรับรู้ได้ถึงการเต้นของหลอดเลือดแดง ทั้งนี้สามารถจับวัดชีพจรได้ในตำแหน่งต่างๆที่หลอดเลือดแดงขนาดกลางอยู่ติดกับผิวหนัง จึงสามารถคลำพบได้ง่าย (ปกติหลอดเลือดแดงจะอยู่ลึก คลำพบยาก หลอดเลือดส่วนใหญ่ที่มอง เห็นจะเป็นหลอดเลือดดำ) เช่น ที่ขาพับด้านนิ้วหัวแม่เท้า ที่ด้านในของขาหนีบ ที่ลำคอส่วนที่ติดกับลูกกระเดือก เป็นต้น"
        }
    ] ;
    i ;
    public constructor(private params: ModalDialogParams) {   
    }
    configure(datePicker: DatePicker) {
    }
    ngOnInit(){
        this.dataUser = JSON.parse(securityService.getDataUser);
        this.info = JSON.parse(securityService.getInfo);
        console.log(securityService.getInfo);

        if (this.info.name == "ระดับน้ำตาลในเลือด") {
            this.i = 0 ;
        }
        else if (this.info.name == "ระดับน้ำตาลเฉลี่ยในเลือด") {
            this.i = 1 ;
        }
        else if (this.info.name == "คอเลสเตอรอลที่ดี") {
            this.i = 2 ;
        }
        else if (this.info.name == "ไขมันไม่ดี") {
            this.i = 3 ;
        }
        else if (this.info.name == "ความดันโลหิต") {
            this.i = 4 ;
        }
        else if (this.info.name == "ชีพจร") {
            this.i = 5 ;
        }
    }
    public close(res: Date) {
        this.params.closeCallback(res);
    }

}